# project_pknu [홈페이지명]
- 농산물 홈쇼핑 페이지
- 시간이 된다면, 공동구매 메신져 서비스도 제공!   
# 🔥 1st day(2022-01-28)
### 📜 today's task
- page 구조 ✅ 
- db 설계 ✅
### 🐬result
- db 설계를 해보긴 했으나 잘 된건지 확신할 수 없다...💦
- 더 추가할 사항이 있어 보인다.   
--> 문의사항<페이지 내에 추가 / 따로 만들기>, 
--> 카테고리를 나눠 주지 않아도 되는가..? (db의 상품 테이블에 카테고리를 추가해 주는 게 좋을 것 같아 보인다..!)

### 💠페이지 구조
<span style="color:yellow">페이지구조</span>  
- 크게 소비자가 접근할 수 있는 페이지와 판매자가 접근할 수 있는 페이지, 공동으로 접근 가능한 페이지로 나눈다.   
- 틀만 잡아둔 것이기 때문에 후에 필요하다면 더 추가될 수 있다.   
- 회원가입은 소비자/판매자를 나눈다.   

##### 💠[페이지 구성도]
![페이지 구성도](https://user-images.githubusercontent.com/72913881/151560438-69c04b9f-a0d3-4a0b-a68a-d55c2a211879.png)   
+) 공지사항   

### 📦 Database 
- 테이블은 업무논리를 적용해 설계한다.   
#### 🧠 [업무논리]
- 판매자가 **회원 등록**을 하면, 판매자 회원 정보를 **'판매자 승인'** 테이블로 옮긴다.     
  -> 승인이 **완료**되면, **판매자 테이블로** 정보를 옮겨준다.   
  -> 승인이 **거부** 되어도 정보를 **남겨 둔다**. => 차후 해당 판매자의 로그인을 방지하기 위함.(혹은 회원가입 방지)   
  -> 승인 여부는 1 또는 2와 같이 **숫자**로 표시해 둔다.   
  
- 주문 테이블에 담긴 **정보**는 **주문이 끝난 후**(배송이 마무리된 후) 정보를 **삭제**한다.   
  -> 구매확정 개념!(일주일간 기간을 두었다가, 정보 삭제)   
- 상품에 대한 **세부설명**은 **사진**이 들어가도록 한다. -> 사진 테이블은 해당 상품의 상품아이디를 FK로 참조한다.

##### [테이블]
![KakaoTalk_20220128_162613905](https://user-images.githubusercontent.com/72913881/151563855-56589256-ddc5-4d9f-9eac-3bb1bd7fdffa.png)

##### [E-R 다이어그램](속성 표시X)
![e-r](https://user-images.githubusercontent.com/72913881/151571607-e4064432-7d73-44e3-affe-43ff57d20272.png)
----
# 🔥 2st day(2022-01-30)<혼자해보기>
### 📜 today's task
- 검색창 자동완성기능🔼

### 🐬result   
-> 예전 코드 참고 및 구글링.   
-> 다만, 검색 결과가 여러 개 있을 때, 따로따로 표시되도록 하는 데에는 실패...!

### 💬검색창 자동 완성
